## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_dns_managed_zone.primary will be created
+   resource "google_dns_managed_zone" "primary" {
+       creation_time   = (known after apply)
+       description     = "wayofthesys.com DNS zone"
+       dns_name        = "wayofthesys.com."
+       force_destroy   = false
+       id              = (known after apply)
+       managed_zone_id = (known after apply)
+       name            = "wayofthesys.com"
+       name_servers    = (known after apply)
+       project         = (known after apply)
+       visibility      = "public"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
